In [80]:
import pandas as pd
import numpy as np
info = pd.read_csv('StudentsPerformance.csv')
info.groupby('lunch').agg([np.mean, np.var]).T

info.groupby('lunch').agg(['mean', 'var']).T

lunch               free/reduced    standard
math score    mean     58.921127   70.034109
              var     229.824270  186.418089
reading score mean     64.653521   71.654264
              var     221.871139  191.285560
writing score mean     63.022535   70.823256
              var     238.202881  205.620887

In [57]:
info.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [60]:
info.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

In [58]:
info.var()

math score       229.918998
reading score    213.165605
writing score    230.907992
dtype: float64

In [73]:
info.groupby('lunch').mean()

              math score  reading score  writing score
lunch
free/reduced   58.921127      64.653521      63.022535
standard       70.034109      71.654264      70.823256

In [70]:
info.loc[info.lunch != 'standard'].mean()

math score       58.921127
reading score    64.653521
writing score    63.022535
dtype: float64